apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rtc.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_rtc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <stdint.h>
#include <assert.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/spinlock.h>

#include "clock/clock.h"

#include "esp32s3_clockconfig.h"
#include "esp32s3_rt_timer.h"
#include "esp32s3_reset_reasons.h"

#include "hardware/esp32s3_bb.h"
#include "hardware/esp32s3_nrx.h"
#include "hardware/esp32s3_fe.h"
#include "hardware/esp32s3_rtccntl.h"
#include "hardware/esp32s3_rtc_io.h"
#include "hardware/esp32s3_system.h"
#include "hardware/esp32s3_tim.h"
#include "hardware/esp32s3_apb_ctrl.h"
#include "hardware/regi2c_dig_reg.h"
#include "hardware/regi2c_ctrl.h"
#include "hardware/esp32s3_syscon.h"
#include "hardware/regi2c_bbpll.h"
#include "hardware/regi2c_lp_bias.h"

#include "xtensa.h"
#include "esp_attr.h"
#include "soc/extmem_reg.h"
#include "soc/spi_mem_reg.h"

#include "esp32s3_rtc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Various delays to be programmed into power control state machines */

#define RTC_CNTL_XTL_BUF_WAIT_SLP   2
#define RTC_CNTL_CK8M_WAIT_SLP      4
#define OTHER_BLOCKS_POWERUP        1
#define OTHER_BLOCKS_WAIT           1

#define ROM_RAM_POWERUP_CYCLES      OTHER_BLOCKS_POWERUP
#define ROM_RAM_WAIT_CYCLES         OTHER_BLOCKS_WAIT

#define WIFI_POWERUP_CYCLES         OTHER_BLOCKS_POWERUP
#define WIFI_WAIT_CYCLES            OTHER_BLOCKS_WAIT

#define RTC_POWERUP_CYCLES          OTHER_BLOCKS_POWERUP
#define RTC_WAIT_CYCLES             OTHER_BLOCKS_WAIT

#define DG_WRAP_POWERUP_CYCLES      OTHER_BLOCKS_POWERUP
#define DG_WRAP_WAIT_CYCLES         OTHER_BLOCKS_WAIT

#define RTC_MEM_POWERUP_CYCLES      OTHER_BLOCKS_POWERUP
#define RTC_MEM_WAIT_CYCLES         OTHER_BLOCKS_WAIT

#define RTC_CNTL_PLL_BUF_WAIT_SLP   2

#define DELAY_FAST_CLK_SWITCH       3

#define XTAL_32K_DAC_VAL            1
#define XTAL_32K_DRES_VAL           3
#define XTAL_32K_DBIAS_VAL          0

#define XTAL_32K_EXT_DAC_VAL        2
#define XTAL_32K_EXT_DRES_VAL       3
#define XTAL_32K_EXT_DBIAS_VAL      1

#define DELAY_SLOW_CLK_SWITCH       300

#define DELAY_8M_ENABLE             50

#define RETRY_CAL_EXT               1

#define CLK_LL_PLL_80M_FREQ_MHZ    (80)
#define CLK_LL_PLL_160M_FREQ_MHZ   (160)
#define CLK_LL_PLL_240M_FREQ_MHZ   (240)

/* Lower threshold for a reasonably-looking calibration value for a 32k XTAL.
 * The ideal value (assuming 32768 Hz frequency)
 * is 1000000/32768*(2**19) = 16*10^6.
 */

#define MIN_32K_XTAL_CAL_VAL        15000000L

/* Frequency of the 8M oscillator is 8.5MHz +/- 5%, at the default DCAP
 * setting
 */

#define RTC_FAST_CLK_FREQ_APPROX    17500000
#define RCT_FAST_D256_FREQ_APPROX   (RTC_FAST_CLK_FREQ_APPROX / 256)
#define RTC_SLOW_CLK_FREQ_APPROX    32768

/* Disable logging from the ROM code. */

#define RTC_DISABLE_ROM_LOG ((1 << 0) | (1 << 16))

/* Set sleep_init default param */

#define RTC_CNTL_DBG_ATTEN_LIGHTSLEEP_DEFAULT  (5)
#define RTC_CNTL_DBG_ATTEN_LIGHTSLEEP_NODROP   (0)
#define RTC_CNTL_DBG_ATTEN_DEEPSLEEP_DEFAULT   (14)
#define RTC_CNTL_DBG_ATTEN_DEEPSLEEP_ULTRA_LOW (15)
#define RTC_CNTL_DBG_ATTEN_DEEPSLEEP_NODROP    (0)
#define RTC_CNTL_BIASSLP_SLEEP_DEFAULT         (1)
#define RTC_CNTL_BIASSLP_SLEEP_ON              (0)
#define RTC_CNTL_PD_CUR_SLEEP_DEFAULT          (1)
#define RTC_CNTL_PD_CUR_SLEEP_ON               (0)
#define RTC_CNTL_DG_VDD_DRV_B_SLP_DEFAULT      (0xf)

#define RTC_CNTL_DBG_ATTEN_MONITOR_DEFAULT     (0)
#define RTC_CNTL_BIASSLP_MONITOR_DEFAULT       (1)
#define RTC_CNTL_BIASSLP_MONITOR_ON            (0)
#define RTC_CNTL_PD_CUR_MONITOR_DEFAULT        (1)
#define RTC_CNTL_PD_CUR_MONITOR_ON             (0)

/* Set LDO slave during CPU switch */

#define DEFAULT_LDO_SLAVE 0x7

/* Approximate mapping of voltages to RTC_CNTL_DBIAS_WAK, RTC_CNTL_DBIAS_SLP,
 * RTC_CNTL_DIG_DBIAS_WAK, RTC_CNTL_DIG_DBIAS_SLP values.
 * Valid if RTC_CNTL_DBG_ATTEN is 0.
 */

#define RTC_CNTL_DBIAS_SLP  0   /* sleep dig_dbias & rtc_dbias */
#define RTC_CNTL_DBIAS_0V90 13  /* digital voltage */
#define RTC_CNTL_DBIAS_0V95 16
#define RTC_CNTL_DBIAS_1V00 18
#define RTC_CNTL_DBIAS_1V05 20
#define RTC_CNTL_DBIAS_1V10 23
#define RTC_CNTL_DBIAS_1V15 25
#define RTC_CNTL_DBIAS_1V20 28
#define RTC_CNTL_DBIAS_1V25 30
#define RTC_CNTL_DBIAS_1V30 31 /* voltage is about 1.34v in fact */

/* Default initializer for esp32s3_rtc_sleep_config_t
 * This initializer sets all fields to "reasonable" values
 * (e.g. suggested for production use) based on a combination
 * of RTC_SLEEP_PD_x flags.
 */

#define is_dslp(pd_flags)   ((pd_flags) & RTC_SLEEP_PD_DIG)

#define RTC_SLEEP_CONFIG_DEFAULT(sleep_flags) { \
  .lslp_mem_inf_fpu = 0, \
  .rtc_mem_inf_follow_cpu = ((sleep_flags) & RTC_SLEEP_PD_RTC_MEM_FOLLOW_CPU) ? 1 : 0, \
  .rtc_fastmem_pd_en = ((sleep_flags) & RTC_SLEEP_PD_RTC_FAST_MEM) ? 1 : 0, \
  .rtc_slowmem_pd_en = ((sleep_flags) & RTC_SLEEP_PD_RTC_SLOW_MEM) ? 1 : 0, \
  .rtc_peri_pd_en = ((sleep_flags) & RTC_SLEEP_PD_RTC_PERIPH) ? 1 : 0, \
  .wifi_pd_en = ((sleep_flags) & RTC_SLEEP_PD_WIFI) ? 1 : 0, \
  .bt_pd_en = ((sleep_flags) & RTC_SLEEP_PD_BT) ? 1 : 0, \
  .cpu_pd_en = ((sleep_flags) & RTC_SLEEP_PD_CPU) ? 1 : 0, \
  .int_8m_pd_en = ((sleep_flags) & RTC_SLEEP_PD_INT_8M) ? 1 : 0, \
  .dig_peri_pd_en = ((sleep_flags) & RTC_SLEEP_PD_DIG_PERIPH) ? 1 : 0, \
  .deep_slp = ((sleep_flags) & RTC_SLEEP_PD_DIG) ? 1 : 0, \
  .wdt_flashboot_mod_en = 0, \
  .vddsdio_pd_en = ((sleep_flags) & RTC_SLEEP_PD_VDDSDIO) ? 1 : 0, \
  .xtal_fpu = ((sleep_flags) & RTC_SLEEP_PD_XTAL) ? 0 : 1, \
  .deep_slp_reject = 1, \
  .light_slp_reject = 1, \
  .rtc_dbias_slp = RTC_CNTL_DBIAS_1V10, \
}

#define X32K_CONFIG_DEFAULT() { \
  .dac = 3, \
  .dres = 3, \
  .dgm = 3, \
  .dbuf = 1, \
}

/* Initializer for rtc_sleep_pu_config_t which sets all flags
 * to the same value
 */

#define RTC_SLEEP_PU_CONFIG_ALL(val) {\
  .dig_fpu = (val), \
  .rtc_fpu = (val), \
  .cpu_fpu = (val), \
  .i2s_fpu = (val), \
  .bb_fpu = (val), \
  .nrx_fpu = (val), \
  .fe_fpu = (val), \
  .sram_fpu = (val), \
  .rom_ram_fpu = (val), \
}

/* Default initializer of struct esp32s3_rtc_config_s.
 * This initializer sets all fields to "reasonable" values
 * (e.g. suggested for production use).
 */

