apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rtc.c
#define RTC_CONFIG_DEFAULT() {\
  .ck8m_wait = RTC_CNTL_CK8M_WAIT_DEFAULT, \
  .xtal_wait = RTC_CNTL_XTL_BUF_WAIT_DEFAULT, \
  .pll_wait  = RTC_CNTL_PLL_BUF_WAIT_DEFAULT, \
  .clkctl_init = 1, \
  .pwrctl_init = 1, \
  .rtc_dboost_fpd = 1, \
  .xtal_fpu = 0, \
  .bbpll_fpu = 0, \
  .cpu_waiti_clk_gate = 1, \
  .cali_ocode = 0 \
}

/* The magic data for the struct esp32s3_rtc_backup_s that is in RTC slow
 * memory.
 */

#define MAGIC_RTC_SAVE UINT64_C(0x11223344556677)

/* RTC Memory & Store Register usage */

#define RTC_SLOW_CLK_CAL_REG    RTC_CNTL_RTC_STORE1_REG /* RTC_SLOW_CLK calibration value */
#define RTC_BOOT_TIME_LOW_REG   RTC_CNTL_RTC_STORE2_REG /* Boot time, low word */
#define RTC_BOOT_TIME_HIGH_REG  RTC_CNTL_RTC_STORE3_REG /* Boot time, high word */
#define RTC_XTAL_FREQ_REG       RTC_CNTL_RTC_STORE4_REG /* External XTAL frequency */
#define RTC_APB_FREQ_REG        RTC_CNTL_RTC_STORE5_REG /* APB bus frequency */
#define RTC_ENTRY_ADDR_REG      RTC_CNTL_RTC_STORE6_REG /* FAST_RTC_MEMORY_ENTRY */
#define RTC_RESET_CAUSE_REG     RTC_CNTL_RTC_STORE6_REG
#define RTC_MEMORY_CRC_REG      RTC_CNTL_RTC_STORE7_REG /* FAST_RTC_MEMORY_CRC */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* RTC power and clock control initialization settings */

struct esp32s3_rtc_priv_s
{
  uint32_t ck8m_wait : 8;         /* Number of rtc_fast_clk cycles to wait for 8M clock to be ready */
  uint32_t xtal_wait : 8;         /* Number of rtc_fast_clk cycles to wait for XTAL clock to be ready */
  uint32_t pll_wait : 8;          /* Number of rtc_fast_clk cycles to wait for PLL to be ready */
  uint32_t clkctl_init : 1;       /* Perform clock control related initialization */
  uint32_t pwrctl_init : 1;       /* Perform power control related initialization */
  uint32_t rtc_dboost_fpd : 1;    /* Force power down RTC_DBOOST */
  uint32_t xtal_fpu : 1;
  uint32_t bbpll_fpu : 1;
  uint32_t cpu_waiti_clk_gate : 1;
  uint32_t cali_ocode : 1;        /* Calibrate Ocode to make bangap voltage more precise */
};

/* sleep configuration for rtc_sleep_init function */

struct esp32s3_rtc_sleep_config_s
{
  uint32_t lslp_mem_inf_fpu : 1;       /* force normal voltage in sleep mode (digital domain memory) */
  uint32_t rtc_mem_inf_follow_cpu : 1; /* keep low voltage in sleep mode (even if ULP/touch is used) */
  uint32_t rtc_fastmem_pd_en : 1;      /* power down RTC fast memory */
  uint32_t rtc_slowmem_pd_en : 1;      /* power down RTC slow memory */
  uint32_t rtc_peri_pd_en : 1;         /* power down RTC peripherals */
  uint32_t wifi_pd_en : 1;             /* power down Wi-Fi */
  uint32_t bt_pd_en : 1;               /* power down BT */
  uint32_t cpu_pd_en : 1;              /* power down CPU, but not restart when lightsleep */
  uint32_t int_8m_pd_en : 1;           /* power down internal 8MHz oscillator */
  uint32_t dig_peri_pd_en : 1;         /* power down digital peripherals */
  uint32_t deep_slp : 1;               /* power down digital domain */
  uint32_t wdt_flashboot_mod_en : 1;   /* enable WDT flashboot mode */
  uint32_t dig_dbias_slp : 5;          /* set bias for digital domain, in sleep mode */
  uint32_t rtc_dbias_slp : 5;          /* set bias for RTC domain, in sleep mode */
  uint32_t bias_sleep_monitor : 1;     /* circuit control parameter, in monitor mode */
  uint32_t dbg_atten_slp : 4;          /* voltage parameter, in sleep mode */
  uint32_t bias_sleep_slp : 1;         /* circuit control parameter, in sleep mode */
  uint32_t pd_cur_monitor : 1;         /* circuit control parameter, in monitor mode */
  uint32_t pd_cur_slp : 1;             /* circuit control parameter, in sleep mode */
  uint32_t vddsdio_pd_en : 1;          /* power down VDDSDIO regulator */
  uint32_t xtal_fpu : 1;               /* keep main XTAL powered up in sleep */
  uint32_t rtc_regulator_fpu  : 1;     /* keep rtc regulator powered up in sleep */
  uint32_t deep_slp_reject : 1;
  uint32_t light_slp_reject : 1;
};

/* Power up flags for rtc_sleep_pu function */

struct esp32s3_rtc_sleep_pu_config_s
{
  uint32_t dig_fpu : 1;     /* Set to 1 to power UP digital part in sleep */
  uint32_t rtc_fpu : 1;     /* Set to 1 to power UP RTC memories in sleep */
  uint32_t cpu_fpu : 1;     /* Set to 1 to power UP digital memories and CPU in sleep */
  uint32_t i2s_fpu : 1;     /* Set to 1 to power UP I2S in sleep */
  uint32_t bb_fpu : 1;      /* Set to 1 to power UP WiFi in sleep */
  uint32_t nrx_fpu : 1;     /* Set to 1 to power UP WiFi in sleep */
  uint32_t fe_fpu : 1;      /* Set to 1 to power UP WiFi in sleep */
  uint32_t sram_fpu : 1;    /* Set to 1 to power UP SRAM in sleep */
  uint32_t rom_ram_fpu : 1; /* Set to 1 to power UP ROM/IRAM0_DRAM0 in sleep */
};

/* crystal configuration */

struct esp32s3_rtc_x32k_config_s
{
  uint32_t dac : 6;
  uint32_t dres : 3;
  uint32_t dgm : 3;
  uint32_t dbuf: 1;
};

#ifdef CONFIG_RTC_ALARM
struct alm_cbinfo_s
{
  struct rt_timer_s *alarm_hdl;  /* Timer id point to here */
  volatile alm_callback_t ac_cb; /* Client callback function */
  volatile void *ac_arg;         /* Argument to pass with the callback function */
  uint64_t deadline_us;
  uint8_t index;
};
#endif

struct esp32s3_rtc_backup_s
{
  uint64_t magic;
  int64_t  offset;              /* Offset time from RTC HW value */
  int64_t  reserved0;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* APB Frequency */

static uint32_t g_apb_freq;

/* Callback to use when the alarm expires */

#ifdef CONFIG_RTC_ALARM
static struct alm_cbinfo_s g_alarmcb[RTC_ALARM_LAST];
#endif

static RTC_DATA_ATTR struct esp32s3_rtc_backup_s rtc_saved_data;

/* Saved data for persistent RTC time */

static struct esp32s3_rtc_backup_s *g_rtc_save;
static bool g_rt_timer_enabled = false;
static uint32_t g_dig_dbias_pvt_240m = 28;
static uint32_t g_rtc_dbias_pvt_240m = 28;
static uint32_t g_dig_dbias_pvt_non_240m = 27;
static uint32_t g_rtc_dbias_pvt_non_240m = 27;

static spinlock_t g_rtc_lock = SP_UNLOCKED;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void IRAM_ATTR esp32s3_rtc_sleep_pu(
                      struct esp32s3_rtc_sleep_pu_config_s cfg);
static inline bool esp32s3_clk_val_is_valid(uint32_t val);
static void IRAM_ATTR esp32s3_rtc_clk_fast_freq_set(
                      enum esp32s3_rtc_fast_freq_e fast_freq);
static uint32_t IRAM_ATTR esp32s3_rtc_clk_cal_internal(
                enum esp32s3_rtc_cal_sel_e cal_clk,
                uint32_t slowclk_cycles);
static void IRAM_ATTR esp32s3_rtc_clk_slow_freq_set(
                      enum esp32s3_rtc_slow_freq_e slow_freq);
static void esp32s3_select_rtc_slow_clk(enum esp32s3_slow_clk_sel_e
                                        slow_clk);
static void esp32s3_rtc_clk_32k_enable(bool enable);
static void IRAM_ATTR esp32s3_rtc_clk_8m_enable(bool clk_8m_en,
                                                bool d256_en);
static void esp32s3_rtc_calibrate_ocode(void);
static void IRAM_ATTR esp32s3_rtc_bbpll_disable(void);
static void IRAM_ATTR esp32s3_rtc_bbpll_enable(void);
static void IRAM_ATTR esp32s3_rtc_bbpll_configure(
                     enum esp32s3_rtc_xtal_freq_e xtal_freq, int pll_freq);
static void IRAM_ATTR esp32s3_rtc_clk_cpu_freq_to_8m(void);
static void IRAM_ATTR esp32s3_rtc_clk_cpu_freq_to_pll_mhz(
                                             int cpu_freq_mhz);
void esp32s3_rtc_clk_apb_freq_update(uint32_t apb_freq);
void IRAM_ATTR esp32s3_rtc_update_to_xtal(int freq, int div);
uint32_t esp32s3_rtc_clk_apb_freq_get(void);

#ifdef CONFIG_RTC_ALARM
static void IRAM_ATTR esp32s3_rt_cb_handler(void *arg);
#endif
/****************************************************************************
 * Public Data
 ****************************************************************************/

volatile bool g_rtc_enabled = false;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/* Set the real CPU ticks per us to the ets, so that ets_delay_us
 * will be accurate. Call this function when CPU frequency is changed.
 */

extern void ets_update_cpu_frequency(uint32_t ticks_per_us);

/* Pauses execution for us microseconds */

extern void esp_rom_delay_us(uint32_t us);

/* Get the reset reason for CPU. */

extern soc_reset_reason_t esp_rom_get_reset_reason(int cpu_no);

/****************************************************************************
 * Name: esp32s3_rtc_sleep_pu
 *
 * Description:
 *   Configure whether certain peripherals are powered up in deep sleep.
 *
 * Input Parameters:
 *   cfg - Power down flags as rtc_sleep_pu_config_t structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR
        esp32s3_rtc_sleep_pu(struct esp32s3_rtc_sleep_pu_config_s cfg)
{
  REG_SET_FIELD(RTC_CNTL_DIG_PWC_REG,
                RTC_CNTL_LSLP_MEM_FORCE_PU, cfg.dig_fpu);
  REG_SET_FIELD(RTC_CNTL_RTC_PWC_REG,
                RTC_CNTL_RTC_FASTMEM_FORCE_LPU, cfg.rtc_fpu);
  REG_SET_FIELD(RTC_CNTL_RTC_PWC_REG,
                RTC_CNTL_RTC_SLOWMEM_FORCE_LPU, cfg.rtc_fpu);
  REG_SET_FIELD(SYSCON_FRONT_END_MEM_PD_REG,
                SYSCON_DC_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(SYSCON_FRONT_END_MEM_PD_REG,
                SYSCON_PBUS_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(SYSCON_FRONT_END_MEM_PD_REG,
                SYSCON_AGC_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(BBPD_CTRL, BB_FFT_FORCE_PU, cfg.bb_fpu);
  REG_SET_FIELD(BBPD_CTRL, BB_DC_EST_FORCE_PU, cfg.bb_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_RX_ROT_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_VIT_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_DEMAP_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(FE_GEN_CTRL, FE_IQ_EST_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(FE2_TX_INTERP_CTRL, FE2_TX_INF_FORCE_PU, cfg.fe_fpu);

  if (cfg.sram_fpu)
    {
      REG_SET_FIELD(SYSCON_MEM_POWER_UP_REG,
                    SYSCON_SRAM_POWER_UP, SYSCON_SRAM_POWER_UP);
    }
  else
    {
      REG_SET_FIELD(SYSCON_MEM_POWER_UP_REG, SYSCON_SRAM_POWER_UP, 0);
    }

  if (cfg.rom_ram_fpu)
    {
      REG_SET_FIELD(SYSCON_MEM_POWER_UP_REG, SYSCON_ROM_POWER_UP,
                    SYSCON_ROM_POWER_UP);
    }
  else
    {
      REG_SET_FIELD(SYSCON_MEM_POWER_UP_REG, SYSCON_ROM_POWER_UP, 0);
    }
}

/****************************************************************************
 * Name: esp32s3_rtc_clk_fast_freq_set
 *
 * Description:
 *   Select source for RTC_FAST_CLK.
 *
 * Input Parameters:
 *   cfg - Clock source (one of enum esp32s3_rtc_fast_freq_e values)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

