apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rtc.c
  /* Wait calibration done */

  while (!(getreg32(I2C_MST_ANA_CONF0_REG) & I2C_MST_BBPLL_CAL_DONE));

  /* Delay 10us after calibration done to fix bbpll calibration may
   * stop early.
   */

  esp_rom_delay_us(10);

  /* BBPLL calibration stop */

  modifyreg32(I2C_MST_ANA_CONF0_REG, I2C_MST_BBPLL_STOP_FORCE_LOW,
              I2C_MST_BBPLL_STOP_FORCE_HIGH);
}

/****************************************************************************
 * Name: esp32s3_rtc_clk_set
 *
 * Description:
 *   Set RTC CLK frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32s3_rtc_clk_set(void)
{
  enum esp32s3_rtc_fast_freq_e fast_freq = RTC_FAST_FREQ_8M;
  enum esp32s3_slow_clk_sel_e slow_clk = SLOW_CLK_150K;

#if defined(CONFIG_ESP32S3_RTC_CLK_EXT_XTAL)
  slow_clk = SLOW_CLK_32K_XTAL;
#elif defined(CONFIG_ESP32S3_RTC_CLK_EXT_OSC)
  slow_clk = SLOW_CLK_32K_EXT_OSC;
#elif defined(CONFIG_ESP32S3_RTC_CLK_INT_8MD256)
  slow_clk = SLOW_CLK_8MD256;
#endif

  esp32s3_rtc_clk_fast_freq_set(fast_freq);
  esp32s3_select_rtc_slow_clk(slow_clk);
}

/****************************************************************************
 * Name: esp32s3_rtc_init
 *
 * Description:
 *   Initialize RTC clock and power control related functions.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_rtc_init(void)
{
  struct esp32s3_rtc_priv_s cfg = RTC_CONFIG_DEFAULT();
  soc_reset_reason_t rst_reas = esp_rom_get_reset_reason(0);

  /* When power on, we need to set `cali_ocode` to 1, to do a OCode
   * calibration, which will calibrate the rtc reference voltage to a
   * tested value
   */

  if (rst_reas == RESET_REASON_CHIP_POWER_ON)
    {
      cfg.cali_ocode = 1;
    }

  /* When run rtc_init, it maybe deep sleep reset. Since we power down modem
   * in deep sleep, after wakeup from deep sleep, these fields are changed
   * and not reset. We will access two BB regs(BBPD_CTRL and NRXPD_CTRL) in
   * rtc_sleep_pu. If PD modem and no iso, CPU will stuck when access these
   * two BB regs and finally triggle RTC WDT. So need to clear modem Force
   * PD. No worry about the power consumption, Because modem Force PD will
   * be set at the end of this function.
   */

  modifyreg32(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_WIFI_FORCE_ISO, 0);
  modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_WIFI_FORCE_PD, 0);

  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_XPD_RTC_REG, 0);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_XPD_DIG_REG, 0);

  modifyreg32(RTC_CNTL_RTC_ANA_CONF_REG, RTC_CNTL_PVTMON_PU, 0);

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER1_REG, RTC_CNTL_PLL_BUF_WAIT,
                cfg.pll_wait);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER1_REG, RTC_CNTL_CK8M_WAIT,
                cfg.ck8m_wait);

  /* Moved from rtc sleep to rtc init to save sleep function running time */

  /* set shortest possible sleep time limit */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER5_REG, RTC_CNTL_MIN_SLP_VAL,
                RTC_CNTL_MIN_SLP_VAL_MIN);

  /* set wifi timer */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER3_REG, RTC_CNTL_WIFI_POWERUP_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER3_REG, RTC_CNTL_WIFI_WAIT_TIMER, 1);

  /* set bt timer */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER3_REG, RTC_CNTL_BT_POWERUP_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER3_REG, RTC_CNTL_BT_WAIT_TIMER, 1);

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER6_REG, RTC_CNTL_CPU_TOP_POWERUP_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER6_REG, RTC_CNTL_CPU_TOP_WAIT_TIMER, 1);

  /* Set rtc peri timer */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER4_REG, RTC_CNTL_RTC_POWERUP_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER4_REG, RTC_CNTL_RTC_WAIT_TIMER, 1);

  /* Set digital wrap timer */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER4_REG, RTC_CNTL_DG_WRAP_POWERUP_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER4_REG, RTC_CNTL_DG_WRAP_WAIT_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER6_REG, RTC_CNTL_DG_PERI_POWERUP_TIMER, 1);
  REG_SET_FIELD(RTC_CNTL_RTC_TIMER6_REG, RTC_CNTL_DG_PERI_WAIT_TIMER, 1);

  /* Reset RTC bias to default value (needed if waking up from deep sleep) */

  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_RTC_DREG_SLEEP,
                    RTC_CNTL_DBIAS_1V10);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_RTC_DREG,
                    RTC_CNTL_DBIAS_1V10);

  /* Set the wait time to the default value. */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER2_REG, RTC_CNTL_ULPCP_TOUCH_START_WAIT,
                RTC_CNTL_ULPCP_TOUCH_START_WAIT_DEFAULT);
  if (cfg.cali_ocode)
    {
      /* TODO: Use calibration from efuse if configured */

      esp32s3_rtc_calibrate_ocode();
    }

  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_RTC_DREG,
                    g_rtc_dbias_pvt_non_240m);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_DIG_DREG,
                    g_dig_dbias_pvt_non_240m);
  if (cfg.clkctl_init)
    {
      /* clear CMMU clock force on */

      modifyreg32(EXTMEM_CACHE_MMU_POWER_CTRL_REG,
                  EXTMEM_CACHE_MMU_MEM_FORCE_ON, 0);

      /* clear clkgate force on */

      putreg32(0, SYSCON_CLKGATE_FORCE_ON_REG);

      /* clear tag clock force on */

      modifyreg32(EXTMEM_DCACHE_TAG_POWER_CTRL_REG,
                  EXTMEM_DCACHE_TAG_MEM_FORCE_ON, 0);
      modifyreg32(EXTMEM_ICACHE_TAG_POWER_CTRL_REG,
                  EXTMEM_ICACHE_TAG_MEM_FORCE_ON, 0);

      /* clear register clock force on */

      modifyreg32(SPI_MEM_CLOCK_GATE_REG(0), SPI_MEM_CLK_EN, 0);
      modifyreg32(SPI_MEM_CLOCK_GATE_REG(1), SPI_MEM_CLK_EN, 0);
    }

  if (cfg.pwrctl_init)
    {
      modifyreg32(RTC_CNTL_RTC_CLK_CONF_REG, RTC_CNTL_CK8M_FORCE_PU, 0);

      /* Cancel xtal force pu if no need to force power up
       * Cannot cancel xtal force pu if pll is force power on
       */

      if (!(cfg.xtal_fpu || cfg.bbpll_fpu))
        {
          modifyreg32(RTC_CNTL_RTC_OPTIONS0_REG, RTC_CNTL_XTL_FORCE_PU, 0);
        }
      else
        {
          modifyreg32(RTC_CNTL_RTC_OPTIONS0_REG, 0, RTC_CNTL_XTL_FORCE_PU);
        }

