apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rtc.c
  REG_SET_FIELD(TIMG_RTCCALICFG_REG(0), TIMG_RTC_CALI_MAX, 0);
  modifyreg32(TIMG_RTCCALICFG_REG(0), 0, TIMG_RTC_CALI_START);

  /* RDY needs some time to go low */

  up_udelay(1);

  while (!(getreg32(TIMG_RTCCALICFG_REG(0)) & TIMG_RTC_CALI_RDY))
    {
      up_udelay(1);
    }
}

void esp32s3_rtc_clk_apb_freq_update(uint32_t apb_freq)
{
  g_apb_freq = apb_freq;
}

uint32_t esp32s3_rtc_clk_apb_freq_get(void)
{
  return g_apb_freq;
}

/****************************************************************************
 * Name: esp32s3_rtc_cpu_freq_set_xtal
 *
 * Description:
 *   Switch CPU clock source to XTAL
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_rtc_cpu_freq_set_xtal(void)
{
  int freq_mhz = (int)esp32s3_rtc_clk_xtal_freq_get();
  esp32s3_rtc_update_to_xtal(freq_mhz, 1);
  esp32s3_rtc_bbpll_disable();
}

/****************************************************************************
 * Name: esp_rtc_clk_get_cpu_freq
 *
 * Description:
 *   Get the currently used CPU frequency configuration.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   CPU frequency
 *
 ****************************************************************************/

int IRAM_ATTR esp_rtc_clk_get_cpu_freq(void)
{
  uint32_t source_freq_mhz;
  uint32_t div;
  uint32_t soc_clk_sel;
  uint32_t cpuperiod_sel;
  int freq_mhz = 0;

  soc_clk_sel = REG_GET_FIELD(SYSTEM_SYSCLK_CONF_REG, SYSTEM_SOC_CLK_SEL);
  switch (soc_clk_sel)
    {
      case DPORT_SOC_CLK_SEL_XTAL:
        {
          div = REG_GET_FIELD(SYSTEM_SYSCLK_CONF_REG,
                              SYSTEM_PRE_DIV_CNT) + 1;
          source_freq_mhz = (uint32_t) esp32s3_rtc_clk_xtal_freq_get();
          freq_mhz = source_freq_mhz / div;
        }
        break;

      case DPORT_SOC_CLK_SEL_PLL:
        {
          cpuperiod_sel = REG_GET_FIELD(SYSTEM_CPU_PER_CONF_REG,
                                        SYSTEM_CPUPERIOD_SEL);
          uint32_t pllfreq_sel = REG_GET_FIELD(SYSTEM_CPU_PER_CONF_REG,
                                               SYSTEM_PLL_FREQ_SEL);
          source_freq_mhz = (pllfreq_sel) ? RTC_PLL_FREQ_480M :
                                            RTC_PLL_FREQ_320M;
          if (cpuperiod_sel == DPORT_CPUPERIOD_SEL_80)
            {
              div = (source_freq_mhz == RTC_PLL_FREQ_480M) ? 6 : 4;
              freq_mhz = 480 / div;
            }
          else if (cpuperiod_sel == DPORT_CPUPERIOD_SEL_160)
                 {
                   div = 3;
                   freq_mhz = 480 / div;
                 }
          else if (cpuperiod_sel == DPORT_CPUPERIOD_SEL_240)
                 {
                   div = 2;
                   freq_mhz = 480 / div;
                 }
          else
            {
              rtcerr("unsupported frequency configuration");
              return -ENODEV;
            }
        }
        break;

      case DPORT_SOC_CLK_SEL_8M:
        {
          source_freq_mhz = 8;
          div = 1;
          freq_mhz = source_freq_mhz / div;
        }
        break;

      default:
        {
          rtcerr("unsupported frequency configuration");
          return -ENODEV;
        }
    }

  return freq_mhz;
}

/****************************************************************************
 * Name: esp32s3_rtc_sleep_init
 *
 * Description:
 *   Prepare the chip to enter sleep mode
 *
 * Input Parameters:
 *   flags - sleep mode configuration
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_rtc_sleep_init(uint32_t flags)
{
  struct esp32s3_rtc_sleep_config_s cfg = RTC_SLEEP_CONFIG_DEFAULT(flags);
  if (flags & RTC_SLEEP_PD_DIG)
    {
      DEBUGASSERT(flags & RTC_SLEEP_PD_XTAL);
      cfg.dig_dbias_slp = 0;

      /* RTC voltage from high to low */

      if ((flags & RTC_SLEEP_USE_ADC_TESEN_MONITOR) ||
          (!(flags & RTC_SLEEP_PD_INT_8M)))
        {
          /* RTC voltage in sleep mode >= 0.9v if 8MD256 select as RTC
           * slow clock src, only need dbg_atten_slp set to 0
           * Support all features:
           * - 8MD256 as RTC slow clock src
           * - ADC/Temperature sensor in monitor mode (ULP)
           *   (also need pd_cur_monitor = 0)
           * - RTC IO as input
           * - RTC Memory at high temperature
           * - ULP
           * - Touch sensor
           */

          cfg.rtc_regulator_fpu = 1;
          cfg.dbg_atten_slp = RTC_CNTL_DBG_ATTEN_DEEPSLEEP_NODROP;
        }
      else if (flags & RTC_SLEEP_NO_ULTRA_LOW)
        {
          /* RTC voltage in sleep mode >= 0.7v (default mode):
           * Support follow features:
           * - RTC IO as input
           * - RTC Memory at high temperature
           * - ULP
           * - Touch sensor
           */

          cfg.rtc_regulator_fpu = 1;
          cfg.dbg_atten_slp = RTC_CNTL_DBG_ATTEN_DEEPSLEEP_DEFAULT;
        }
      else
        {
          /* RTC regulator not opened and rtc voltage is about 0.66v
           * (ultra low power).
           * Support follow features:
           * - ULP
           * - Touch sensor
           */

          cfg.rtc_regulator_fpu = 0;
          cfg.dbg_atten_slp = RTC_CNTL_DBG_ATTEN_DEEPSLEEP_ULTRA_LOW;
        }
    }
  else
    {
      cfg.rtc_regulator_fpu = 1;

      /* Voltage from high to low */

      if ((flags & RTC_SLEEP_DIG_USE_8M) || !(flags & RTC_SLEEP_PD_XTAL))
        {
          /* digital voltage not less than 1.1v, rtc voltage is about 1.1v
           * Support all features:
           * - XTAL
           * - RC 8M used by digital system
           * - 8MD256 as RTC slow clock src (only need dbg_atten_slp to 0)
           * - ADC/Temperature sensor in monitor mode (ULP)
           *   (also need pd_cur_monitor = 0)
           * - ULP
           * - Touch sensor
           */

          cfg.dbg_atten_slp = RTC_CNTL_DBG_ATTEN_LIGHTSLEEP_NODROP;
          cfg.dig_dbias_slp = RTC_CNTL_DBIAS_1V10;
        }
      else if (!(flags & RTC_SLEEP_PD_INT_8M))
        {
          /* dbg_atten_slp need to set to 0.
           * digital voltage is about 0.67v, rtc voltage is about 1.1v
           * Support features:
           * - 8MD256 as RTC slow clock src
           * - ADC/Temperature sensor in monitor mode (ULP)
           *   (also need pd_cur_monitor = 0)
           * - ULP
           * - Touch sensor
           */

          cfg.dbg_atten_slp = RTC_CNTL_DBG_ATTEN_LIGHTSLEEP_NODROP;
          cfg.dig_dbias_slp = 0;
        }
      else
        {
          /* digital voltage not less than 0.6v, rtc voltage is about 0.95v
           * Support features:
           * - ADC/Temperature sensor in monitor mode (ULP)
           *   (also need pd_cur_monitor = 0)
           * - ULP
           * - Touch sensor
           */

