apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_rtc.c
          cfg.dbg_atten_slp = RTC_CNTL_DBG_ATTEN_LIGHTSLEEP_DEFAULT;
          cfg.dig_dbias_slp = RTC_CNTL_DBIAS_SLP;
        }
    }

  if (!(flags & RTC_SLEEP_PD_XTAL))
    {
      cfg.bias_sleep_monitor = RTC_CNTL_BIASSLP_MONITOR_ON;
      cfg.pd_cur_monitor = RTC_CNTL_PD_CUR_MONITOR_ON;
      cfg.bias_sleep_slp = RTC_CNTL_BIASSLP_SLEEP_ON;
      cfg.pd_cur_slp = RTC_CNTL_PD_CUR_SLEEP_ON;
    }
  else
    {
      cfg.bias_sleep_monitor = RTC_CNTL_BIASSLP_MONITOR_DEFAULT;
      cfg.pd_cur_monitor = (flags & RTC_SLEEP_USE_ADC_TESEN_MONITOR) ?
                                    RTC_CNTL_PD_CUR_MONITOR_ON :
                                    RTC_CNTL_PD_CUR_MONITOR_DEFAULT;

      cfg.bias_sleep_slp = RTC_CNTL_BIASSLP_SLEEP_DEFAULT;
      cfg.pd_cur_slp = RTC_CNTL_PD_CUR_SLEEP_DEFAULT;
    }

  /* Starts here */

  if (cfg.lslp_mem_inf_fpu)
    {
      struct esp32s3_rtc_sleep_pu_config_s
             pu_cfg = RTC_SLEEP_PU_CONFIG_ALL(1);
      esp32s3_rtc_sleep_pu(pu_cfg);
    }

  if (cfg.wifi_pd_en)
    {
      modifyreg32(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_WIFI_FORCE_NOISO |
                  RTC_CNTL_WIFI_FORCE_ISO, 0);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_WIFI_FORCE_PU, 0);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, 0, RTC_CNTL_WIFI_PD_EN);
    }
  else
    {
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_WIFI_PD_EN, 0);
    }

  if (cfg.bt_pd_en)
    {
      modifyreg32(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_BT_FORCE_NOISO |
                  RTC_CNTL_BT_FORCE_ISO, 0);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_BT_FORCE_PU, 0);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, 0, RTC_CNTL_BT_PD_EN);
    }
  else
    {
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_BT_PD_EN, 0);
    }

  if (cfg.cpu_pd_en)
    {
      modifyreg32(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_CPU_TOP_FORCE_NOISO |
                  RTC_CNTL_CPU_TOP_FORCE_ISO, 0);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_CPU_TOP_FORCE_PU,
                  RTC_CNTL_CPU_TOP_PD_EN);
    }
  else
    {
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_CPU_TOP_PD_EN, 0);
    }

  if (cfg.dig_peri_pd_en)
    {
      modifyreg32(RTC_CNTL_DIG_ISO_REG, RTC_CNTL_DG_PERI_FORCE_NOISO |
                  RTC_CNTL_DG_PERI_FORCE_ISO, 0);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_DG_PERI_FORCE_PU,
                  RTC_CNTL_DG_PERI_PD_EN);
    }
  else
    {
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_DG_PERI_PD_EN, 0);
    }

  if (cfg.rtc_peri_pd_en)
    {
      modifyreg32(RTC_CNTL_RTC_PWC_REG, RTC_CNTL_RTC_FORCE_NOISO |
                  RTC_CNTL_RTC_FORCE_ISO | RTC_CNTL_RTC_FORCE_PU,
                  RTC_CNTL_RTC_PD_EN);
    }
  else
    {
      modifyreg32(RTC_CNTL_RTC_PWC_REG, RTC_CNTL_RTC_PD_EN, 0);
    }

  DEBUGASSERT(!cfg.pd_cur_monitor || cfg.bias_sleep_monitor);
  DEBUGASSERT(!cfg.pd_cur_slp || cfg.bias_sleep_slp);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_RTC_DREG_SLEEP,
                    cfg.rtc_dbias_slp);
  REGI2C_WRITE_MASK(I2C_DIG_REG, I2C_DIG_REG_EXT_DIG_DREG_SLEEP,
                    cfg.dig_dbias_slp);

  REG_SET_FIELD(RTC_CNTL_RTC_BIAS_CONF_REG, RTC_CNTL_DBG_ATTEN_DEEP_SLP,
                cfg.dbg_atten_slp);
  REG_SET_FIELD(RTC_CNTL_RTC_BIAS_CONF_REG, RTC_CNTL_BIAS_SLEEP_DEEP_SLP,
                cfg.bias_sleep_slp);
  REG_SET_FIELD(RTC_CNTL_RTC_BIAS_CONF_REG, RTC_CNTL_PD_CUR_DEEP_SLP,
                cfg.pd_cur_slp);
  REG_SET_FIELD(RTC_CNTL_RTC_BIAS_CONF_REG, RTC_CNTL_DBG_ATTEN_MONITOR,
                RTC_CNTL_DBG_ATTEN_MONITOR_DEFAULT);
  REG_SET_FIELD(RTC_CNTL_RTC_BIAS_CONF_REG, RTC_CNTL_BIAS_SLEEP_MONITOR,
                cfg.bias_sleep_monitor);
  REG_SET_FIELD(RTC_CNTL_RTC_BIAS_CONF_REG, RTC_CNTL_PD_CUR_MONITOR,
                cfg.pd_cur_monitor);

  if (cfg.deep_slp)
    {
      modifyreg32(RTC_CNTL_DIG_PWC_REG, 0, RTC_CNTL_DG_WRAP_PD_EN);
      modifyreg32(RTC_CNTL_RTC_ANA_CONF_REG, RTC_CNTL_CKGEN_I2C_PU |
                  RTC_CNTL_PLL_I2C_PU | RTC_CNTL_RFRX_PBUS_PU |
                  RTC_CNTL_TXRF_I2C_PU, 0);
    }
  else
    {
      REG_SET_FIELD(RTC_CNTL_RTC_REGULATOR_DRV_CTRL_REG,
                    RTC_CNTL_DG_VDD_DRV_B_SLP,
                    RTC_CNTL_DG_VDD_DRV_B_SLP_DEFAULT);
      modifyreg32(RTC_CNTL_DIG_PWC_REG, RTC_CNTL_DG_WRAP_PD_EN, 0);
    }

  /* Mem force pu */

  modifyreg32(RTC_CNTL_DIG_PWC_REG, 0, RTC_CNTL_LSLP_MEM_FORCE_PU);
  modifyreg32(RTC_CNTL_RTC_PWC_REG, 0, RTC_CNTL_RTC_FASTMEM_FORCE_LPU |
              RTC_CNTL_RTC_SLOWMEM_FORCE_LPU);
  REG_SET_FIELD(RTC_CNTL_RTC_REG, RTC_CNTL_RTC_REGULATOR_FORCE_PU,
                cfg.rtc_regulator_fpu);
  if (!cfg.int_8m_pd_en)
    {
      REG_SET_BIT(RTC_CNTL_RTC_CLK_CONF_REG, RTC_CNTL_CK8M_FORCE_PU);
    }
  else
    {
      REG_CLR_BIT(RTC_CNTL_RTC_CLK_CONF_REG, RTC_CNTL_CK8M_FORCE_PU);
    }

  /* Enable VDDSDIO control by state machine */

  REG_CLR_BIT(RTC_CNTL_RTC_SDIO_CONF_REG, RTC_CNTL_SDIO_FORCE);
  REG_SET_FIELD(RTC_CNTL_RTC_SDIO_CONF_REG, RTC_CNTL_SDIO_REG_PD_EN,
                cfg.vddsdio_pd_en);
  REG_SET_FIELD(RTC_CNTL_RTC_SLP_REJECT_CONF_REG,
                RTC_CNTL_DEEP_SLP_REJECT_EN, cfg.deep_slp_reject);
  REG_SET_FIELD(RTC_CNTL_RTC_SLP_REJECT_CONF_REG,
                RTC_CNTL_LIGHT_SLP_REJECT_EN, cfg.light_slp_reject);

  /* Set wait cycle for touch or COCPU after deep sleep and light sleep. */

  REG_SET_FIELD(RTC_CNTL_RTC_TIMER2_REG,
                RTC_CNTL_ULPCP_TOUCH_START_WAIT,
                RTC_CNTL_ULPCP_TOUCH_START_WAIT_IN_SLEEP);

  REG_SET_FIELD(RTC_CNTL_RTC_OPTIONS0_REG,
                RTC_CNTL_XTL_FORCE_PU, cfg.xtal_fpu);
  REG_SET_FIELD(RTC_CNTL_RTC_CLK_CONF_REG,
                RTC_CNTL_XTAL_GLOBAL_FORCE_NOGATING, cfg.xtal_fpu);
}

/****************************************************************************
 * Name: esp32s3_rtc_sleep_start
 *
 * Description:
 *   Enter force sleep mode.
 *
 * Input Parameters:
 *   wakeup_opt - Bit mask wake up reasons to enable
 *   reject_opt - Bit mask of sleep reject reasons.
 *
 * Returned Value:
 *   non-zero if sleep was rejected by hardware
 *
 ****************************************************************************/

int IRAM_ATTR esp32s3_rtc_sleep_start(uint32_t wakeup_opt,
                                     uint32_t reject_opt)
{
  int reject;
  REG_SET_FIELD(RTC_CNTL_RTC_WAKEUP_STATE_REG,
                RTC_CNTL_RTC_WAKEUP_ENA, wakeup_opt);
  REG_SET_FIELD(RTC_CNTL_RTC_SLP_REJECT_CONF_REG,
                RTC_CNTL_RTC_SLEEP_REJECT_ENA, reject_opt);

  modifyreg32(RTC_CNTL_INT_CLR_RTC_REG, 0,
              RTC_CNTL_SLP_REJECT_INT_CLR | RTC_CNTL_SLP_WAKEUP_INT_CLR);

  /* Start entry into sleep mode */

